app/controllers/attractions_controller.rb

INSERT INTO "attractions" ("name", "town", "description", "group", "created_at", "updated_at") VALUES('Tower Hill', 'London', 'Historic monument', 'History', '2010-05-22 16:01:44', '2010-05-22 16:01:44')
---
  def create
    @attraction = Attraction.new(params[:attraction])

    respond_to do |format|
      if @attraction.save

SELECT * FROM "attractions" WHERE ("attractions"."id" = 3)
DELETE FROM "attractions" WHERE "id" = 3
---
  def destroy
    @attraction = Attraction.find(params[:id])
    @attraction.destroy

SELECT * FROM "attractions" WHERE ("attractions"."id" = 1)
---
  def edit
    @attraction = Attraction.find(params[:id])

SELECT * FROM "attractions" WHERE ("attractions"."id" = 1)
---
  def random
      @attraction = Attraction.find(:first, :order => 'RANDOM()')

SELECT * FROM "attractions"
---
  def results

    @attractions = Attraction.all

SELECT * FROM "attractions" WHERE ("attractions"."id" = 1)
---
  def show
    @attraction = Attraction.find(params[:id])

SELECT * FROM "attractions" WHERE ("attractions"."id" = 1)
UPDATE "attractions" SET "description" = 'Historic monument across Thames river', "updated_at" = '2010-05-23 01:17:58' WHERE "id" = 1
---
  def update
    @attraction = Attraction.find(params[:id])

    respond_to do |format|
      if @attraction.update_attributes(params[:attraction])